// 25. Найти сумму чисел от 1 до А

Console.WriteLine("Введите число ");
int NumberA = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"Сумма чисел от 1 до {NumberA} равна {(NumberA+1)*NumberA/2}");
