// 5. Написать программу вычисления значения функции y = f(a)
double x = 5.4;
double y = 9999;
y = x*x*(x + x);
Console.WriteLine(y);